app/controllers/events_controller.rb

INSERT INTO "events" ("address", "name", "end_time", "created_at", "updated_at", "phone", "display_name", "add_mailing_list", "start_time", "email") VALUES('test', 'test', '2010-05-30 00:00:00', '2010-05-28 20:00:18', '2010-05-28 20:00:18', 'test', 'f', 'f', '2010-05-29 20:00:00', 'testt')
---
  def create
    render :status => 400, :text => "error, nothing submitted" unless params.has_key? :events
    @year, @month, @day = params[:events]["year"], params[:events]["month"], params[:events]["day"]
    start_time = Time.mktime(@year.to_i, @month.to_i, @day.to_i, params[:events]["start_time(4i)"].to_i, params[:events]["start_time(5i)"].to_i)
    end_time = start_time + (3600*params[:events][:hours_needed].to_i)
    @event = Event.new(
      :start_time => start_time,
      :end_time => end_time,
      :email => params[:events][:email],
      :address => params[:events][:address],
      :phone => params[:events][:phone],
      :name => params[:events][:name],
      :add_mailing_list => params[:events][:add_mailing_list],
      :display_name => params[:events][:display_name])
    if @event.save